app/controllers/api/users_controller.rb

INSERT INTO "users" ("email", "name", "phone", "birth_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["email", "[FILTERED]"], ["name", "Test User"], ["phone", "010-1234-5678"], ["birth_date", "1990-01-01"], ["created_at", "2025-09-09 13:40:23.688096"], ["updated_at", "2025-09-09 13:40:23.688096"]]
---
  def create
    @user = User.new(user_params)

    if @user.save

UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Updated Name"], ["updated_at", "2025-09-09 13:40:23.668087"], ["id", 2]]
---
  def update
    if @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 6]]
---
  def destroy
    @user.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def set_user
    @user = User.find(params[:id])