backend/app/services/message_cache_service.rb

INSERT INTO "messages" ("conversation_id","role","content","created_at","updated_at") VALUES (8, 'assistant', '', '2025-09-11 18:09:58.028386', '2025-09-11 18:09:58.028386'), (8, 'user', '', '2025-09-11 18:09:57.726333', '2025-09-11 18:09:57.726333') ON CONFLICT  DO NOTHING RETURNING "id"
---
            end

            # 벌크 인서트
            Message.insert_all(messages_to_insert) if messages_to_insert.any?

SELECT "messages"."id" FROM "messages" WHERE "messages"."conversation_id" = 2
INSERT INTO "messages" ("conversation_id","role","content","has_user_audio","audio_format","audio_duration","created_at","updated_at") VALUES (2, 'assistant', 'Chunk 1Chunk 2', FALSE, NULL, NULL, '2025-09-11 18:09:57.703618', '2025-09-11 18:09:57.703618'), (2, 'user', 'Test streaming', FALSE, NULL, NULL, '2025-09-11 18:09:57.679136', '2025-09-11 18:09:57.679136'), (2, 'assistant', 'Test AI response', FALSE, NULL, NULL, '2025-09-11 18:09:57.589136', '2025-09-11 18:09:57.589136'), (2, 'user', 'Hello, AI!', FALSE, NULL, NULL, '2025-09-11 18:09:57.563731', '2025-09-11 18:09:57.563731') ON CONFLICT  DO NOTHING RETURNING "id"
---
              end

              # 중복 방지: 이미 DB에 있는 메시지는 제외
              existing_message_ids = Message.where(conversation_id: conversation_id).pluck(:id)

              Message.insert_all(messages_to_insert) if messages_to_insert.any?

SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = 20 AND (created_at < '2025-09-12 04:31:23.600318') ORDER BY "messages"."created_at" DESC LIMIT 19
---
    def get_message_history(conversation_id, limit: 50)
      # 캐시된 메시지
      cached = get_cached_messages(conversation_id, limit: limit)

      # DB에서 최신 메시지 (캐시에 없는 것들)
      last_cached_time = cached.last&.dig(:timestamp) || 1.hour.ago

      db_messages = Message.where(conversation_id: conversation_id)
                          .where("created_at < ?", last_cached_time)
                          .order(created_at: :desc)
                          .limit(limit - cached.size)
                          .map do |msg|