backend/app/controllers/chat_controller.rb

  def current_user
    # 테스트용 간단한 인증
    @current_user ||= User.find_by(id: params[:user_id] || session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1