backend/app/controllers/chat_controller.rb

INSERT INTO "conversations" ("user_id", "title", "created_at", "updated_at") VALUES (1, '자기소개하기', '2025-09-12 04:30:22.989413', '2025-09-12 04:30:22.989413') RETURNING "id"
---
  def create
    return render json: { error: 'User not found' }, status: :unprocessable_entity unless current_user

    # 멤버십 또는 쿠폰 확인 및 처리
    result = current_user.process_conversation_start!
    if result[:type] == 'error'
      return render json: {
        error: result[:message],
        has_membership: current_user.has_active_membership?,
        has_coupons: current_user.has_available_coupons?
      }, status: :forbidden
    end

    @conversation = current_user.conversations.create!(title: params[:title])

SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = 11 AND (created_at < '2025-09-11 18:14:56.562541') ORDER BY "messages"."created_at" DESC LIMIT 19
---
  def message_audio
    return render json: { error: 'User not found' }, status: :unprocessable_entity unless current_user

    audio_file = params[:audio_file]
    conversation_id = params[:conversation_id]

    unless audio_file && conversation_id
      return render json: { error: 'Missing audio file or conversation ID' }, status: :bad_request
    end

    begin
      # Use Gemini for Speech-to-Text
      gemini = GeminiService.new
      transcribed_text = gemini.transcribe_audio(audio_file)

      # Cache the message with audio metadata
      user_message_id = MessageCacheService.cache_message(
        conversation_id,
        'user',
        transcribed_text,
        audio_metadata: {
          has_audio: true,
          format: audio_file.content_type&.split('/')&.last || 'webm',
          size: audio_file.size,
          filename: audio_file.original_filename
        }
      )

SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" IS NULL AND (created_at < '2025-09-09 14:36:01.875090') ORDER BY "messages"."created_at" DESC LIMIT 19
---
  def message
    response.headers['Content-Type'] = 'text/event-stream'
    response.headers['Cache-Control'] = 'no-cache'
    response.headers['X-Accel-Buffering'] = 'no'

    gemini = GeminiService.new
    message = params[:message]
    conversation_id = params[:conversation_id]
    audio_file = params[:audio_file]

    # 사용자 메시지 Redis 캐싱 (비동기) + 오디오 메타데이터
    user_message_id = MessageCacheService.cache_message(
      conversation_id,
      'user',
      message,
      audio_metadata: extract_audio_metadata(audio_file)
    )

    # 대화 히스토리 가져오기 (캐시 + DB 병합)
    conversation_history = MessageCacheService.get_message_history(
      conversation_id,
      limit: 20
    ).map { |m| { role: m[:role], content: m[:content] } }

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def current_user
    # 테스트용 간단한 인증
    @current_user ||= User.find_by(id: params[:user_id] || session[:user_id])