backend/app/controllers/api/auth_controller.rb

  def login
    email = params[:email]
    # 비밀번호 파라미터는 받지만 실제로는 사용하지 않음

    # DB에서 이메일로 사용자 검색
    user = User.find_by(email: email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'test@nonexistent.com' LIMIT 1

  def verify_token(token)
    # 간단한 토큰 검증 (실제로는 더 안전한 방식 사용)
    return nil unless token.start_with?('token_')

    parts = token.split('_')
    return nil unless parts.length >= 4

    user_id = parts[1].to_i
    User.find_by(id: user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1