backend/app/controllers/api/coupons_controller.rb

  def index
    @coupons = @user.coupons.order(:created_at)
    render json: @coupons.map { |coupon| coupon_json(coupon) }
---
SELECT "coupons".* FROM "coupons" WHERE "coupons"."user_id" = 17 ORDER BY "coupons"."created_at" ASC