backend/app/controllers/api/payments_controller.rb

  def set_user
    @user = User.find_by(id: params[:user_id]) || User.first # 인증 로직 없이 간단히 처리
---
SELECT "users".* FROM "users" WHERE "users"."id" = 17 LIMIT 1

  def create_membership_after_payment(membership_type, price, payment_result)
    # 기존 멤버십 삭제
    @user.membership&.destroy

    # 새 멤버십 생성
    @membership = @user.create_membership!(
      membership_type: membership_type,
      start_date: Date.current,
      end_date: Date.current + Membership::DURATION_DAYS[membership_type].days,
      price: price,
      status: "active"
    )

    # 결제 정보 저장 (필요 시 별도 Payment 모델 생성 가능)
    @membership.update!(
      payment_key: payment_result[:paymentKey],
      order_id: payment_result[:orderId]
    ) if @membership.respond_to?(:payment_key)
---
DELETE FROM "memberships" WHERE "memberships"."id" = 14
INSERT INTO "memberships" ("user_id", "membership_type", "start_date", "end_date", "price", "status", "created_at", "updated_at") VALUES (17, 'premium', '2025-09-12', '2025-11-11', 99000.0, 'active', '2025-09-12 05:28:21.941710', '2025-09-12 05:28:21.941710') RETURNING "id"
UPDATE "memberships" SET "status" = 'expired' WHERE "memberships"."user_id" = 17 AND (end_date >= '2025-09-12' AND status = 'active')