backend/app/controllers/api/admin/memberships_controller.rb

  def destroy
    membership = Membership.find(params[:id])
    user = membership.user

    membership.destroy
---
SELECT "memberships".* FROM "memberships" WHERE "memberships"."id" = 17 LIMIT 1
DELETE FROM "memberships" WHERE "memberships"."id" = 17

  def show
    membership = Membership.find(params[:id])
---
SELECT "memberships".* FROM "memberships" WHERE "memberships"."id" = 17 LIMIT 1

  def index
    memberships = Membership.includes(:user)
    memberships = memberships.where(status: params[:status]) if params[:status].present?
    memberships = memberships.where(membership_type: params[:type]) if params[:type].present?

    render json: memberships.map { |m| membership_json(m) }
---
SELECT "memberships".* FROM "memberships"
SELECT "users".* FROM "users" WHERE "users"."id" IN (16, 18, 19, 21, 22, 23, 24, 25, 26)
SELECT "users".* FROM "users" WHERE "users"."id" IN (16, 18, 19, 21, 22, 23, 24, 25, 26, 17)

  def require_admin
    admin_user_id = params[:admin_user_id]
    admin_user = User.find_by(id: admin_user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 26 LIMIT 1